{
  "main": {
    "name": "Elton Lopes Pereira",
    "description": "Desenvolvedor Front-End",
    "image": "profilepic.jpg",
    "bio": "Olá, sou Elton, tenho 31 anos e estou cursando Tecnologia em Sistemas de Telecomunicações na UTFPR. Atuo como Programador Fullstack, com sólida experiência em HTML, CSS, Java, JavaScript e React, além de habilidades no desenvolvimento de back-end. Busco constantemente aprimorar minhas competências e acompanhar as tendências do desenvolvimento web para entregar soluções completas e eficazes.",
    "contactmessage": "Você pode entrar em contato por WhatsApp ou pelo LinkedIn.",
    "email": "elton_ste@live.com",
    "phone": "(41) 9 9551-4110",
    "github": "https://github.com/Elton-Ti",
    "project": "https://drive.google.com/file/d/1zwHIgfvMn2LFkIrQVJYmZUS1A7NPGV4k/view?usp=drive_link",
    "address": {      
      "city": "Pinhais",
      "state": "Paraná"
    },
    "website": "",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/elton.lopespereira",
        "className": "fa fa-facebook"
      },      
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/elton-lopes-pereira-27465b179/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/oeelton/",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://github.com/Elton-Ti",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Desenvolvedor de software com experiência em Java, com conhecimento em estrutura MVC e Orientação a Objetos. Habilidades em HTML, CSS , Versionamento de projetos com GIT e teste de FrontEnd usando a ferramenta Cypress",
    "education": [
      {
        "school": "Universidade Tecnológica Federal do Paraná",
        "degree": "Tecnologia em Sistemas de Telecomunicações",
        "graduated": "Dezembro de 2024",
        "description": "O curso prepara profissionais para atuar nas áreas de gestão, desenvolvimento, implantação de projetos, operação e manutenção de sistemas de telecomunicações. Um diferencial é a inclusão de matérias de programação, que habilita o estudante a ingressar nessa área."
      },
      {
        "school": "Colégio Estadual Professor Paulo Freire",
        "degree": "Ensino Médio",
        "graduated": "Dezembro de 2011",
        "description": "Seu principal objetivo é aprimorar os conhecimentos obtidos pelos estudantes no ensino fundamental I e II, além de prepará-los para o mercado de trabalho, seja para ingressar imediatamente em uma profissão."
      }
    ],
    "work": [
      {
        "company": "Hospital Inc",
        "title": "Auxiliar-I TI",
        "years": "Dez 2024 - Atual",
        "description":  "Responsável por acionar e acompanhar suporte técnico com terceiros, elaborar manuais técnicos, prestar suporte técnico presencial, remoto e por telefone, além de gerenciar chamados de suporte, garantindo o cumprimento da Política de Segurança da Informação. Atuei na resolução de problemas e atendimento a demandas de TI, realizando também manutenção preventiva e corretiva de computadores e impressoras, sempre com foco na eficiência, organização e continuidade das operações tecnológicas."
      },
      {
        "company": "Eco Medical Center",
        "title": "Tecnico em TI (Estágio)",
        "years": "Out 2024 - Dez 2024",
        "description":  "Atuo como Suporte Técnico Nível 1, cabeamento estruturado e configuração de redes, instalação e suporte à telefonia, montagem e manutenção de computadores, além de instalação de softwares e manutenção de impressoras para garantir o funcionamento contínuo dos sistemas. Realizo diagnósticos e reparos em equipamentos, bem como treinamento dos usuários para uso adequado de tecnologias e sistemas, promovendo autonomia e eficiência no dia a dia. Meu foco é oferecer suporte ágil e eficaz, assegurando a estabilidade e a qualidade dos serviços de TI, sempre com atendimento orientado à resolução de problemas e satisfação do cliente."
      },
      {
        "company": "Copel Distribuição S.A.",
        "title": "Análise de Sistemas (Estágio)",
        "years": "Jul 2022 - Jun 2024",
        "description":  "Participei de um projeto para unificar a agência virtual (AVA), realizando modificações em componentes no front-end para melhorar a interface, como pode ser conferido no link: https://www.copel.com/avaweb/perfilEmpresarialGrpB.jsf. Também dei manutenção ao posto de atendimento virtual, auxiliando atendentes, ajustando botões e telas, além de criar filtros em formato cascata para otimizar o atendimento ao cliente: https://www.copel.com/paveweb/paginasAdm/inicio.jsf. Atuei no auxílio à análise e desenvolvimento de novas soluções, utilizando linguagens como Java e JavaScript, com banco de dados SQL Server, e ferramentas como Teams, GitHub e Cypress."
      }
    ],
    "skills": [
      {
        "name": "JAVA",
        "level": "50%"
      },
      {
        "name": "React",
        "level": "30%"
      },
      {
        "name": "JavaScript",
        "level": "50%"
      },
      {
        "name": "HTML",
        "level": "50%"
      },
      {
        "name": "CSS",
        "level": "50%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Calculadora",
        "category": "Projetos",
        "image": "calculadora.jpg",
        "url": "https://calculadora-react-elton.vercel.app/"
      },
      {
        "title": "HTML 5",
        "category": "Projetos",
        "image": "html.jpg",
        "url": "https://html5-curso-em-video.vercel.app/"
      },
      {
        "title": "Tarefa de Microcontrolado",
        "category": "Projetos",
        "image": "arduino.jpg",
        "url": "https://youtu.be/AAnGGeOL5sM"
      },
      {
        "title": "Fundamentos React",
        "category": "Projetos",
        "image": "react.png",
        "url": "https://hooks-wine.vercel.app/"
      }
    ]
  }
}
