{
  "main": {
    "name": "Elton Lopes Pereira",
    "description": "Desenvolvedor Fullstack",
    "image": "profilepic.jpg",
    "bio": "Olá, sou Elton, tenho 30 anos e estou cursando Tecnologia em Sistemas de Telecomunicações na UTFPR. Atuo como Programador Fullstack, com sólida experiência em HTML, CSS, Java, JavaScript e React, além de habilidades no desenvolvimento de back-end. Busco constantemente aprimorar minhas competências e acompanhar as tendências do desenvolvimento web para entregar soluções completas e eficazes.",
    "contactmessage": "Você pode entrar em contato por WhatsApp ou pelo LinkedIn.",
    "email": "elton_ste@live.com",
    "phone": "(41) 9 9551-4110",
    "github": "https://github.com/Elton-Ti",
    "project": "https://drive.google.com/file/d/1cuaFzCTdB-85RY7MznMvI8y6fg8BBTdZ/view?usp=drive_link",
    "address": {      
      "city": "Pinhais",
      "state": "Paraná"
    },
    "website": "",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/elton.lopespereira",
        "className": "fa fa-facebook"
      },      
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/elton-lopes-pereira-27465b179/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/oeelton/",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://github.com/Elton-Ti",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Desenvolvedor de software versátil, com sólida experiência em Java, Arquitetura MVC e Programação Orientada a Objetos. Tenho habilidades em HTML, CSS e versionamento de projetos com Git, além de experiência em testes de front-end utilizando Cypress. Sou organizado, com boas habilidades de comunicação e focado em soluções criativas. Comprometido com o aprendizado contínuo, destaco-me no desenvolvimento de novas funcionalidades e na manutenção de aplicações web. Busco oportunidades desafiadoras que me permitam aplicar meu conhecimento e crescer na área de tecnologia.",
    "education": [
      {
        "school": "Universidade Tecnológica Federal do Paraná",
        "degree": "Tecnologia em Sistemas de Telecomunicações",
        "graduated": "Dezembro de 2024",
        "description": "O curso prepara profissionais para atuar nas áreas de gestão, desenvolvimento, implantação de projetos, operação e manutenção de sistemas de telecomunicações. Um diferencial é a inclusão de matérias de programação, que habilita o estudante a ingressar nessa área."
      },
      {
        "school": "Colégio Estadual Professor Paulo Freire",
        "degree": "Ensino Médio",
        "graduated": "Dezembro de 2011",
        "description": "Seu principal objetivo é aprimorar os conhecimentos obtidos pelos estudantes no ensino fundamental I e II, além de prepará-los para o mercado de trabalho, seja para ingressar imediatamente em uma profissão."
      }
    ],
    "work": [
      {
        "company": "Copel Distribuição S.A.",
        "title": "Estágio em Análise de Sistemas",
        "years": "Jul 2022 - Jun 2024",
        "description":  "Atuo como responsável pelas demandas da Agência Virtual da Copel, envolvendo tanto a manutenção de aplicações web quanto a implementação de novas funcionalidades. Realizo suporte técnico contínuo, garantindo a estabilidade e eficiência dos sistemas em produção. Além disso, colaboro na documentação de sistemas de informação, auxiliando na padronização e clareza dos processos técnicos, e participo ativamente da análise e desenvolvimento de soluções inovadoras para aprimorar a experiência do usuário e otimizar o desempenho das aplicações.\n Minhas principais competências incluem o uso de linguagens de programação como Java e JavaScript para o desenvolvimento de soluções robustas. No gerenciamento de dados, trabalho com SQL Server, garantindo consultas otimizadas e integrações eficazes. Também utilizo ferramentas colaborativas como Teams para comunicação e gerenciamento de projetos, GitHub para controle de versão e Cypress para automação de testes e garantia de qualidade do front-end. \n Com foco em soluções escaláveis e uma abordagem colaborativa, contribuo para a melhoria contínua dos sistemas da Copel, sempre buscando inovações tecnológicas que agreguem valor às operações e à experiência do usuário final."
      }
    ],
    "skills": [
      {
        "name": "React",
        "level": "30%"
      },
      {
        "name": "JAVA",
        "level": "50%"
      },
      {
        "name": "JavaScript",
        "level": "50%"
      },
      {
        "name": "HTML",
        "level": "50%"
      },
      {
        "name": "CSS",
        "level": "50%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Calculadora-React",
        "category": "Projetos",
        "image": "calculadora.jpg",
        "url": "https://calculadora-react-elton.vercel.app/"
      },
      {
        "title": "HTML 5",
        "category": "Projetos",
        "image": "html.jpg",
        "url": "https://html5-curso-em-video.vercel.app/"
      },
      {
        "title": "Tarefa de Microcontrolado",
        "category": "Projetos",
        "image": "arduino.jpg",
        "url": "https://youtu.be/AAnGGeOL5sM"
      }
    ]
  }
}
